nsanjay01/sx1262_stm32_lorawan/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define RTC_N_PREDIV_S 10
#define RTC_PREDIV_S ((1<<RTC_N_PREDIV_S)-1)
#define RTC_PREDIV_A ((1<<(15-RTC_N_PREDIV_S))-1)
#define USART_BAUDRATE 115200

// /* Pin mapping */

// /* Definition for UARTx clock resources */
// #define DMAx_CLK_ENABLE()                __HAL_RCC_DMA1_CLK_ENABLE()
// #define DMAMUX_CLK_ENABLE()              __HAL_RCC_DMAMUX1_CLK_ENABLE()

// /* Definition for USARTx's DMA Request */
// #define USARTx_TX_DMA_REQUEST             DMA_REQUEST_2
// /* Definition for USARTx's DMA */
// #define USARTx_TX_DMA_CHANNEL             DMA1_Channel7

// /* Definition for USARTx's NVIC */
// #define USARTx_DMA_TX_IRQn                DMA1_Channel7_IRQn
// #define USARTx_DMA_TX_IRQHandler          DMA1_Channel7_IRQHandler

// /* Definition for USARTx's NVIC */
// #define USARTx_IRQn                      USART2_IRQn
// #define USARTx_Priority 0
// #define USARTx_DMA_Priority 0


// #define USARTx_RX_Pin GPIO_PIN_3
// #define USARTx_RX_GPIO_Port GPIOA
// #define USARTx_TX_Pin GPIO_PIN_2
// #define USARTx_TX_GPIO_Port GPIOA

// #define USARTx_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOA_CLK_ENABLE()
// #define USARTx_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOA_CLK_ENABLE()

// #define USARTx_TX_AF                     GPIO_AF7_USART2
// #define USARTx_RX_AF                     GPIO_AF7_USART2


/* Private defines -----------------------------------------------------------*/
#define DIO1 GPIO_PIN_13
#define DIO1_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define NSS_PIN GPIO_PIN_6
#define BUSY_PIN GPIO_PIN_7
#define RESET_PIN GPIO_PIN_3
#define RESET_PIN_PORT GPIOA


/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
